Name - Ankit
Roll No.-19MTS5630
Class-BSc Mathematical Science 2nd year(3rd sem)
Date-07 Sept 2020

In [ ]:
#importing the libraries 
import pandas as pd
import numpy as np

In [ ]:
#mouting drive to colab
from google.colab import drive
drive.mount('/content/gdrive')

Mounted at /content/gdrive

**Handling Missing Data**

In [ ]:
#Creating a series with some nan values
serdata = pd.Series(['aardvark', 'artichoke', np.nan, 'avocado'])
serdata

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [ ]:
##checking the Null/NaN values
serdata.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [ ]:
#None value is also treated as NaN
serdata[0] = None
serdata

0         None
1    artichoke
2          NaN
3      avocado
dtype: object

In [ ]:
#checking again the null values
serdata.isnull()

0     True
1    False
2     True
3    False
dtype: bool

In [ ]:
#Checking for not nan values 
serdata.notnull()

0    False
1     True
2    False
3     True
dtype: bool

**FIltering out missing data**

In [ ]:
#importing  NaN as NA 
from numpy import nan as NA

In [ ]:
#Dropping NA from data series
serdata2 = pd.Series([1, NA, 3.5, NA, 7])
serdata2

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

In [ ]:
#dropping na values
serdata2.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [ ]:
#dropping na values using boolean
serdata2[serdata2.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [ ]:
#Dropping NA values from Dataframes
data=pd.read_csv('/content/gdrive/My Drive/data.csv')
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  6.5  3.0

In [ ]:
#in data frame if any row has single na value it will also be dropped
data_clean = data.dropna()
data_clean

     0    1    2
0  1.0  6.5  3.0

In [ ]:
#if we want to delete only those rows which have all nan value we can do it with how
data_clean = data.dropna(how='all')
data_clean

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  6.5  3.0

In [ ]:
#columns with NA can also be dropped using axis parameter
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  6.5  3.0

In [ ]:
data[4] = NA
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [ ]:
#drop columns with all NaN
data_cleaned = data.dropna(axis=1, how='all')
data_cleaned

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [ ]:
df = pd.read_csv('/content/gdrive/My Drive/data2.csv')
df

          0         1         2
0  0.312480  0.719393 -0.996495
1  1.460961 -1.901471  2.056771
2 -1.122101  1.302537  1.060095
3  0.364036 -0.869845  1.370788
4  0.092968  1.074751  0.150381
5 -0.615898 -1.535240  1.468150
6  1.845395 -0.604971  1.119518

In [ ]:
df.iloc[:4, 1] = NA
df.iloc[:2, 2] = NA
df

          0         1         2
0  0.312480       NaN       NaN
1  1.460961       NaN       NaN
2 -1.122101       NaN  1.060095
3  0.364036       NaN  1.370788
4  0.092968  1.074751  0.150381
5 -0.615898 -1.535240  1.468150
6  1.845395 -0.604971  1.119518

In [ ]:
#dropping rows with NaN
df.dropna()

          0         1         2
4  0.092968  1.074751  0.150381
5 -0.615898 -1.535240  1.468150
6  1.845395 -0.604971  1.119518

In [ ]:
#we can also may restrict the dropping of NaN to a certain number of rows
df.dropna(thresh=2)

          0         1         2
2 -1.122101       NaN  1.060095
3  0.364036       NaN  1.370788
4  0.092968  1.074751  0.150381
5 -0.615898 -1.535240  1.468150
6  1.845395 -0.604971  1.119518

**Filling in Missing Data**

In [ ]:
df

          0         1         2
0  0.312480       NaN       NaN
1  1.460961       NaN       NaN
2 -1.122101       NaN  1.060095
3  0.364036       NaN  1.370788
4  0.092968  1.074751  0.150381
5 -0.615898 -1.535240  1.468150
6  1.845395 -0.604971  1.119518

In [ ]:
#filling the NaN values 
df.fillna(0)

          0         1         2
0  0.312480  0.000000  0.000000
1  1.460961  0.000000  0.000000
2 -1.122101  0.000000  1.060095
3  0.364036  0.000000  1.370788
4  0.092968  1.074751  0.150381
5 -0.615898 -1.535240  1.468150
6  1.845395 -0.604971  1.119518

In [ ]:
#we can fill nan values for different columns
# e.g. 0.5 for NaN in column 1, 0 for NaN in column 2
df.fillna({1: 0.5, 2: 0})

          0         1         2
0  0.312480       NaN       NaN
1  1.460961       NaN       NaN
2 -1.122101       NaN  1.060095
3  0.364036       NaN  1.370788
4  0.092968  1.074751  0.150381
5 -0.615898 -1.535240  1.468150
6  1.845395 -0.604971  1.119518

In [ ]:
#make the changes permanent 
df.fillna(0, inplace=True)

In [ ]:
df

          0         1         2
0  0.312480  0.000000  0.000000
1  1.460961  0.000000  0.000000
2 -1.122101  0.000000  1.060095
3  0.364036  0.000000  1.370788
4  0.092968  1.074751  0.150381
5 -0.615898 -1.535240  1.468150
6  1.845395 -0.604971  1.119518

The same interpolation methods available for reindexing can be used with fillna

In [ ]:
df = pd.read_csv('/content/gdrive/My Drive/data2.csv')
df

          0         1         2
0  0.312480  0.719393 -0.996495
1  1.460961 -1.901471  2.056771
2 -1.122101  1.302537  1.060095
3  0.364036 -0.869845  1.370788
4  0.092968  1.074751  0.150381
5 -0.615898 -1.535240  1.468150
6  1.845395 -0.604971  1.119518

In [ ]:
df.iloc[2:, 1] = NA
df.iloc[4:, 2] = NA
df

          0         1         2
0  0.312480  0.719393 -0.996495
1  1.460961 -1.901471  2.056771
2 -1.122101       NaN  1.060095
3  0.364036       NaN  1.370788
4  0.092968       NaN       NaN
5 -0.615898       NaN       NaN
6  1.845395       NaN       NaN

In [ ]:
#we can also fill nan values with previous value
df.fillna(method='ffill')

          0         1         2
0  0.312480  0.719393 -0.996495
1  1.460961 -1.901471  2.056771
2 -1.122101 -1.901471  1.060095
3  0.364036 -1.901471  1.370788
4  0.092968 -1.901471  1.370788
5 -0.615898 -1.901471  1.370788
6  1.845395 -1.901471  1.370788

In [ ]:
#limitng the row
df.fillna(method='ffill', limit=2)

          0         1         2
0  0.312480  0.719393 -0.996495
1  1.460961 -1.901471  2.056771
2 -1.122101 -1.901471  1.060095
3  0.364036 -1.901471  1.370788
4  0.092968       NaN  1.370788
5 -0.615898       NaN  1.370788
6  1.845395       NaN       NaN

In [ ]:
#filling the NaN values with mean of the remaining items
data = pd.Series([1., NA, 3.5, NA, 7])
data

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

In [ ]:
data.mean()

3.8333333333333335

In [ ]:
data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

**Removing Duplicates**

In [ ]:
data=pd.read_csv('/content/gdrive/My Drive/data3.txt')
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [ ]:
#return boolea for duplicates value
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [ ]:
#dropping duplicates value
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [ ]:
#inserting a third column 
data['k3']=range(7)
data

    k1  k2  k3
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
5  two   4   5
6  two   4   6

In [ ]:
#we can remove duplicate entries based on a single column as well
data.drop_duplicates(['k1'])

    k1  k2  k3
0  one   1   0
1  two   1   1

In [ ]:
#keeping the last row inplace of first row
data.drop_duplicates(['k1', 'k2'], keep='last')

    k1  k2  k3
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
6  two   4   6

**Transforming Data Using a Function or Mapping**

In [ ]:
data = pd.DataFrame({'food': ['bacon', 'pulled pork', 'bacon', 'Pastrami', 'corned beef', 'Bacon', 'pastrami', 'honey ham', 'nova lox'], 'ounces': [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [ ]:
meat_to_animal = {
'bacon': 'pig',
'pulled pork': 'pig',
'pastrami': 'cow',
'corned beef': 'cow',
'honey ham': 'pig',
'nova lox': 'salmon'
}

In [ ]:
#now we will map into the data sets but it some food are in uppercase so we will convert into lower case
lowercased = data['food'].str.lower()
lowercased

0          bacon
1    pulled pork
2          bacon
3       pastrami
4    corned beef
5          bacon
6       pastrami
7      honey ham
8       nova lox
Name: food, dtype: object

In [ ]:
#now we will map them using map function
data['animal'] = lowercased.map(meat_to_animal)
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [ ]:
#we can also do with above same thing using lambda
data['food'].map(lambda x: meat_to_animal[x.lower()])

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object

**Replacing Values**

In [ ]:
data = pd.Series([1., -999., 2., -999., -1000., 3.])
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [ ]:
#replacing values
data.replace(-999, np.nan)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [ ]:
#we can replace multiple values at one time 
data.replace([-999, -1000], np.nan)

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

In [ ]:
#replacing different values with different replacement values
data.replace([-999, -1000], [np.nan, 0])

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [ ]:
#arguemnt can also pass as dict
data.replace({-999: np.nan, -1000: 0})

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

**Renaming Axis Indexes**

In [ ]:
data = pd.DataFrame(np.arange(12).reshape((3, 4)),
                    index=['Ohio', 'Colorado', 'New York'],
                    columns=['one', 'two', 'three', 'four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [ ]:

transform = lambda x: x[:4].upper()
transform

In [ ]:
data.index.map(transform)

Index(['OHIO', 'COLO', 'NEW '], dtype='object')

In [ ]:
data.index = data.index.map(transform)
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [ ]:
#we can create a transformed version of a dataset without 
# modifying the original, a useful method is rename
data.rename(index=str.title, columns=str.upper)

      ONE  TWO  THREE  FOUR
Ohio    0    1      2     3
Colo    4    5      6     7
New     8    9     10    11

In [ ]:
#rename can be used in conjunction with a dict-like object 
data.rename(index={'OHIO': 'INDIANA'}, columns={'three': 'peekaboo'})

         one  two  peekaboo  four
INDIANA    0    1         2     3
COLO       4    5         6     7
NEW        8    9        10    11

In [ ]:
#renaming inplace
data.rename(index={'OHIO': 'INDIANA'}, inplace=True)
data

         one  two  three  four
INDIANA    0    1      2     3
COLO       4    5      6     7
NEW        8    9     10    11

**Discretization & Binning**

In [ ]:
#dividing ages into different groups
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]
ages

[20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]

In [ ]:
#using cut function to divide the data into bins
bins = [18, 25, 35, 60, 100]
category = pd.cut(ages, bins)
category

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [ ]:
#checking the codes
category.codes

array([0, 0, 0, 1, 0, 0, 2, 1, 3, 2, 2, 1], dtype=int8)

In [ ]:
#checking all categories have been created
category.categories

IntervalIndex([(18, 25], (25, 35], (35, 60], (60, 100]],
              closed='right',
              dtype='interval[int64]')

In [ ]:
#counting the items in each category
pd.value_counts(category)

(18, 25]     5
(35, 60]     3
(25, 35]     3
(60, 100]    1
dtype: int64

In [ ]:
pd.cut(ages, [18, 26, 36, 61, 100], right=False)

[[18, 26), [18, 26), [18, 26), [26, 36), [18, 26), ..., [26, 36), [61, 100), [36, 61), [36, 61), [26, 36)]
Length: 12
Categories (4, interval[int64]): [[18, 26) < [26, 36) < [36, 61) < [61, 100)]

In [ ]:
#we can also have customize bin names 
group_names = ['Youth', 'YoungAdult', 'MiddleAged', 'Senior']
pd.cut(ages, bins, labels=group_names)

['Youth', 'Youth', 'Youth', 'YoungAdult', 'Youth', ..., 'YoungAdult', 'Senior', 'MiddleAged', 'MiddleAged', 'YoungAdult']
Length: 12
Categories (4, object): ['Youth' < 'YoungAdult' < 'MiddleAged' < 'Senior']

In [ ]:
data = np.random.rand(20)
# limiting the decimal precision to two digits
pd.cut(data, 4, precision=2)

[(0.01, 0.24], (0.24, 0.46], (0.46, 0.69], (0.46, 0.69], (0.01, 0.24], ..., (0.01, 0.24], (0.24, 0.46], (0.46, 0.69], (0.69, 0.91], (0.24, 0.46]]
Length: 20
Categories (4, interval[float64]): [(0.01, 0.24] < (0.24, 0.46] < (0.46, 0.69] < (0.69, 0.91]]

In [ ]:

data = np.random.randn(1000)

In [ ]:

cats = pd.qcut(data, 4)
cats

[(0.626, 3.928], (-2.9499999999999997, -0.696], (-0.0144, 0.626], (-0.0144, 0.626], (0.626, 3.928], ..., (-0.0144, 0.626], (-0.0144, 0.626], (-0.696, -0.0144], (0.626, 3.928], (-0.0144, 0.626]]
Length: 1000
Categories (4, interval[float64]): [(-2.9499999999999997, -0.696] < (-0.696, -0.0144] < (-0.0144, 0.626] <
                                    (0.626, 3.928]]

In [ ]:
#Just checking whether 4 equal halves have been created or not
pd.value_counts(cats)

(0.726, 2.781]      250
(0.101, 0.726]      250
(-0.617, 0.101]     250
(-3.685, -0.617]    250
dtype: int64

In [ ]:
#we also pass our own quantiles 
cats = pd.qcut(data, [0, 0.1, 0.5, 0.9, 1.])
cats

[(-1.261, 0.101], (1.274, 2.781], (-1.261, 0.101], (-3.685, -1.261], (-3.685, -1.261], ..., (0.101, 1.274], (0.101, 1.274], (1.274, 2.781], (0.101, 1.274], (-1.261, 0.101]]
Length: 1000
Categories (4, interval[float64]): [(-3.685, -1.261] < (-1.261, 0.101] < (0.101, 1.274] <
                                    (1.274, 2.781]]

In [ ]:
pd.value_counts(cats)

(0.101, 1.274]      400
(-1.261, 0.101]     400
(1.274, 2.781]      100
(-3.685, -1.261]    100
dtype: int64

**Detecting and Filtering Outliers**

In [ ]:
data = pd.DataFrame(np.random.randn(1000, 4))

In [ ]:

data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.010317     0.015078    -0.045311    -0.001611
std       0.997417     1.010687     0.994553     0.985781
min      -3.153239    -4.370945    -2.960395    -3.363878
25%      -0.696368    -0.648226    -0.726173    -0.634006
50%      -0.036837     0.031495    -0.076626    -0.011505
75%       0.708201     0.655588     0.684204     0.582760
max       3.178904     3.659395     2.953786     3.422430

In [ ]:

col = data[2]
col[np.abs(col) > 3]

Series([], Name: 2, dtype: float64)

In [ ]:

data[(np.abs(data) > 3).any(1)]

            0         1         2         3
62  -0.265869 -4.370945 -1.319018 -0.255957
211 -1.436961  0.299746 -0.279738  3.422430
212  3.019794  1.085462 -0.220539 -0.722281
293 -1.489134  3.104174  1.641920  1.191990
328 -0.859387  0.410538 -1.317561  3.316958
519 -0.366275 -0.664131 -1.234820 -3.363878
535  0.473926  0.144986 -1.360579  3.126054
668 -0.573678 -3.712848  0.797365  0.804187
723 -1.460501  3.659395  0.521856  0.290396
778  3.178904  0.122942  0.851355  0.736603
932 -3.153239  1.023725 -1.219111 -0.854951

In [ ]:

data[np.abs(data) > 3] = np.sign(data) * 3
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.010363     0.016398    -0.045311    -0.002113
std       0.996328     1.000754     0.994553     0.981810
min      -3.000000    -3.000000    -2.960395    -3.000000
25%      -0.696368    -0.648226    -0.726173    -0.634006
50%      -0.036837     0.031495    -0.076626    -0.011505
75%       0.708201     0.655588     0.684204     0.582760
max       3.000000     3.000000     2.953786     3.000000

In [ ]:

np.sign(data).head()

     0    1    2    3
0 -1.0 -1.0 -1.0  1.0
1 -1.0  1.0  1.0 -1.0
2  1.0  1.0 -1.0 -1.0
3 -1.0 -1.0  1.0 -1.0
4 -1.0 -1.0 -1.0  1.0

**Permutation & Random Sampling**

In [ ]:
df = pd.DataFrame(np.arange(5 * 4).reshape((5, 4)))
df

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19

In [ ]:
sampler = np.random.permutation(5)
sampler

array([1, 0, 3, 2, 4])

In [ ]:

df.take(sampler)

    0   1   2   3
1   4   5   6   7
0   0   1   2   3
3  12  13  14  15
2   8   9  10  11
4  16  17  18  19

In [ ]:

df.sample(n=3)

   0  1   2   3
1  4  5   6   7
2  8  9  10  11
0  0  1   2   3

In [ ]:

df.sample(n=3)

    0   1   2   3
2   8   9  10  11
4  16  17  18  19
3  12  13  14  15

In [ ]:

choices = pd.Series([5, 7, -1, 6, 4])
choices

0    5
1    7
2   -1
3    6
4    4
dtype: int64

In [ ]:
draws = choices.sample(n=10, replace=True)
draws

1    7
4    4
1    7
2   -1
4    4
2   -1
4    4
3    6
4    4
3    6
dtype: int64

**Computing Indicator/Dummy Variables**

In [ ]:
df = pd.DataFrame({'key': ['b', 'b', 'a', 'c', 'a', 'b'], 'data1': range(6)})
df

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   b      5

In [ ]:
pd.get_dummies(df['key'])

   a  b  c
0  0  1  0
1  0  1  0
2  1  0  0
3  0  0  1
4  1  0  0
5  0  1  0

In [ ]:

dummies = pd.get_dummies(df['key'], prefix='key')
dummies

   key_a  key_b  key_c
0      0      1      0
1      0      1      0
2      1      0      0
3      0      0      1
4      1      0      0
5      0      1      0

In [ ]:
df_with_dummy = df[['data1']].join(dummies)
df_with_dummy

   data1  key_a  key_b  key_c
0      0      0      1      0
1      1      0      1      0
2      2      1      0      0
3      3      0      0      1
4      4      1      0      0
5      5      0      1      0

In [ ]:
np.random.seed(12345)
values = np.random.rand(10)
values

array([0.92961609, 0.31637555, 0.18391881, 0.20456028, 0.56772503,
       0.5955447 , 0.96451452, 0.6531771 , 0.74890664, 0.65356987])

In [ ]:
bins = [0, 0.2, 0.4, 0.6, 0.8, 1]
pd.get_dummies(pd.cut(values, bins))

   (0.0, 0.2]  (0.2, 0.4]  (0.4, 0.6]  (0.6, 0.8]  (0.8, 1.0]
0           0           0           0           0           1
1           0           1           0           0           0
2           1           0           0           0           0
3           0           1           0           0           0
4           0           0           1           0           0
5           0           0           1           0           0
6           0           0           0           0           1
7           0           0           0           1           0
8           0           0           0           1           0
9           0           0           0           1           0

**STRING MANIPULATION**

In [ ]:

val = 'a,b, guido'
val.split(',')

['a', 'b', ' guido']

In [ ]:

pieces = [x.strip() for x in val.split(',')]
pieces

['a', 'b', 'guido']

In [ ]:

first, second, third = pieces
first + '::' + second + '::' + third

'a::b::guido'

In [ ]:

'::'.join(pieces)

'a::b::guido'

In [ ]:

'guido' in val

True

In [ ]:
val.index(',')

1

In [ ]:
val.find(':')

-1

In [ ]:
#index raises an expception when string is not found 
val.index(':')

ValueError: ignored

In [ ]:

val.count(',')

In [ ]:

val.replace(',', '::')

In [ ]:
val.replace(',', '')